NextFOAM-2405/tutorials/incompressible/adjointOptimisationFoam/topologyOptimisation/monoFluidAero/laminar/1_Inlet_2_Outlet_Dual_Bottleneck/losses-mass-50-50/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
       (0.0 0.0  0) //0
       (0.4 0.0  0)
       (0.6 0.0  0)
       (0.8 0.0  0)
       (1.0 0.0  0)
       (0.0 0.2  0) //5
       (0.4 0.2  0)
       (0.6 0.2  0)
       (0.8 0.2  0)
       (1.0 0.2  0)
       (0.0 0.4  0) //10
       (0.4 0.4  0)
       (0.6 0.4  0)
       (0.8 0.4  0)
       (1.0 0.4  0)
       (0.0 0.65 0) //15
       (0.4 0.65 0)
       (0.6 0.65 0)
       (0.8 0.65 0)
       (1.0 0.65 0)
       (0.0 1.35 0) //20
       (0.4 1.35 0)
       (0.6 1.35 0)
       (0.8 1.35 0)
       (1.0 1.35 0)
       (0.0 1.6  0) //25
       (0.4 1.6  0)
       (0.6 1.6  0)
       (0.8 1.6  0)
       (1.0 1.6  0)
       (0.0 1.7  0) //30
       (0.4 1.7  0)
       (0.6 1.7  0)
       (0.8 1.7  0)
       (1.0 1.7  0)
       (0.0 1.9  0) //35
       (0.4 1.9  0)
       (0.6 1.9  0)
       (0.8 1.9  0)
       (1.0 1.9  0)
       (0.0 2.0  0) //40
       (0.4 2.0  0)
       (0.6 2.0  0)
       (0.8 2.0  0)
       (1.0 2.0  0) //44

       (0.0 0.0  0.1) //45
       (0.4 0.0  0.1)
       (0.6 0.0  0.1)
       (0.8 0.0  0.1)
       (1.0 0.0  0.1)
       (0.0 0.2  0.1) //50
       (0.4 0.2  0.1)
       (0.6 0.2  0.1)
       (0.8 0.2  0.1)
       (1.0 0.2  0.1)
       (0.0 0.4  0.1) //55
       (0.4 0.4  0.1)
       (0.6 0.4  0.1)
       (0.8 0.4  0.1)
       (1.0 0.4  0.1)
       (0.0 0.65 0.1) //60
       (0.4 0.65 0.1)
       (0.6 0.65 0.1)
       (0.8 0.65 0.1)
       (1.0 0.65 0.1)
       (0.0 1.35 0.1) //65
       (0.4 1.35 0.1)
       (0.6 1.35 0.1)
       (0.8 1.35 0.1)
       (1.0 1.35 0.1)
       (0.0 1.6  0.1) //70
       (0.4 1.6  0.1)
       (0.6 1.6  0.1)
       (0.8 1.6  0.1)
       (1.0 1.6  0.1)
       (0.0 1.7  0.1) //75
       (0.4 1.7  0.1)
       (0.6 1.7  0.1)
       (0.8 1.7  0.1)
       (1.0 1.7  0.1)
       (0.0 1.9  0.1) //80
       (0.4 1.9  0.1)
       (0.6 1.9  0.1)
       (0.8 1.9  0.1)
       (1.0 1.9  0.1)
       (0.0 2.0  0.1) //85
       (0.4 2.0  0.1)
       (0.6 2.0  0.1)
       (0.8 2.0  0.1)
       (1.0 2.0  0.1) //89

       (-0.5 1.7 0) //90
       (-0.5 1.9 0) //91
       (-0.5 1.7 0.1) //92
       (-0.5 1.9 0.1) //93

       (0.6 -0.5 0) //94
       (0.8 -0.5 0) //95
       (0.6 -0.5 0.1) //96
       (0.8 -0.5 0.1) //97

       (1.5 0.2 0) //98
       (1.5 0.4 0) //99
       (1.5 0.2 0.1) //100
       (1.5 0.4 0.1) //101
);

blocks
(
    hex (90 30 35 91 92 75 80 93) (50 20 1) simpleGrading (1 1 1) //0
    hex (94 95  3  2 96 97 48 47) (20 50 1) simpleGrading (1 1 1) //0
    hex ( 9 98 99 14 54 100 101 59) (50 20 1) simpleGrading (1 1 1) //0

    hex ( 0  1  6  5 45 46 51 50) (40 20 1) simpleGrading (1 1 1)
    hex ( 1  2  7  6 46 47 52 51) (20 20 1) simpleGrading (1 1 1)
    hex ( 2  3  8  7 47 48 53 52) (20 20 1) simpleGrading (1 1 1)
    hex ( 3  4  9  8 48 49 54 53) (20 20 1) simpleGrading (1 1 1)
    hex ( 5  6 11 10 50 51 56 55) (40 20 1) simpleGrading (1 1 1) //5
    hex ( 6  7 12 11 51 52 57 56) (20 20 1) simpleGrading (1 1 1)
    hex ( 7  8 13 12 52 53 58 57) (20 20 1) simpleGrading (1 1 1)
    hex ( 8  9 14 13 53 54 59 58) (20 20 1) simpleGrading (1 1 1)
    hex (11 12 17 16 56 57 62 61) (20 25 1) simpleGrading (1 1 1)
    hex (12 13 18 17 57 58 63 62) (20 25 1) simpleGrading (1 1 1) //10
    hex (13 14 19 18 58 59 64 63) (20 25 1) simpleGrading (1 1 1)
    hex (15 16 21 20 60 61 66 65) (40 70 1) simpleGrading (1 1 1)
    hex (16 17 22 21 61 62 67 66) (20 70 1) simpleGrading (1 1 1)
    hex (21 22 27 26 66 67 72 71) (20 25 1) simpleGrading (1 1 1)
    hex (22 23 28 27 67 68 73 72) (20 25 1) simpleGrading (1 1 1) //15
    hex (23 24 29 28 68 69 74 73) (20 25 1) simpleGrading (1 1 1)
    hex (25 26 31 30 70 71 76 75) (40 10 1) simpleGrading (1 1 1)
    hex (26 27 32 31 71 72 77 76) (20 10 1) simpleGrading (1 1 1)
    hex (27 28 33 32 72 73 78 77) (20 10 1) simpleGrading (1 1 1)
    hex (28 29 34 33 73 74 79 78) (20 10 1) simpleGrading (1 1 1) //20
    hex (30 31 36 35 75 76 81 80) (40 20 1) simpleGrading (1 1 1)
    hex (31 32 37 36 76 77 82 81) (20 20 1) simpleGrading (1 1 1)
    hex (32 33 38 37 77 78 83 82) (20 20 1) simpleGrading (1 1 1)
    hex (33 34 39 38 78 79 84 83) (20 20 1) simpleGrading (1 1 1)
    hex (35 36 41 40 80 81 86 85) (40 10 1) simpleGrading (1 1 1) //25
    hex (36 37 42 41 81 82 87 86) (20 10 1) simpleGrading (1 1 1)
    hex (37 38 43 42 82 83 88 87) (20 10 1) simpleGrading (1 1 1)
    hex (38 39 44 43 83 84 89 88) (20 10 1) simpleGrading (1 1 1)
);

edges
(
);

patches         
(
    patch inlet
    (
        (91 90 92 93)
    )
    patch outlet
    (
        (94 95 97 96)
    )
    patch outlet-right
    (
        (98 99 101 100)
    )
    wall designWall
    (
        (40 35 80 85) //0
        (41 40 85 86)
        (42 41 86 87)
        (43 42 87 88)
        (44 43 88 89)
        (39 44 89 84) //5
        (34 39 84 79)
        (29 34 79 74)
        (24 29 74 69)
        (23 24 69 68)
        (22 23 68 67) //10
        (17 22 67 62)
        (18 17 62 63)
        (19 18 63 64)
        (14 19 64 59)
        ( 4  9 54 49) //15
        ( 3  4 49 48)
        ( 1  2 47 46)
        ( 0  1 46 45)
        ( 5  0 45 50)
        (10  5 50 55) //20
        (11 10 55 56)
        (16 11 56 61)
        (15 16 61 60)
        (20 15 60 65)
        (21 20 65 66) //25
        (26 21 66 71)
        (25 26 71 70)
        (30 25 70 75)
    )
    wall IEntranceWall
    (
        (91 93 80 35) //0
        (92 90 30 75)
    )
    wall OEntranceWall
    (
        ( 2 94 96 47) //0
        ( 3 48 97 95)
    )
    wall OREntranceWall
    (
        (14 59 101 99) //0
        ( 9 98 100 54)
    )
    empty back
    (
        // back
        ( 5  6  1  0) //0
        ( 6  7  2  1)
        ( 7  8  3  2)
        ( 8  9  4  3)
        (10 11  6  5)
        (11 12  7  6) //5
        (12 13  8  7)
        (13 14  9  8)
        (16 17 12 11)
        (17 18 13 12)
        (18 19 14 13) //10
        (20 21 16 15)
        (21 22 17 16)
        (26 27 22 21)
        (27 28 23 22)
        (28 29 24 23) //15
        (30 31 26 25)
        (31 32 27 26)
        (32 33 28 27)
        (33 34 29 28)
        (35 36 31 30) //20
        (36 37 32 31)
        (37 38 33 32)
        (38 39 34 33)
        (40 41 36 35)
        (41 42 37 36) //25
        (42 43 38 37)
        (43 44 39 38)

        (35 30 90 91)
        ( 2  3 95 94)
        ( 9 14 99 98)

        // front
        (51 50 45 46)
        (52 51 46 47)
        (53 52 47 48) //30
        (54 53 48 49)
        (56 55 50 51)
        (57 56 51 52)
        (58 57 52 53)
        (59 58 53 54) //35
        (62 61 56 57)
        (63 62 57 58)
        (64 63 58 59)
        (66 65 60 61)
        (67 66 61 62) //40
        (72 71 66 67)
        (73 72 67 68)
        (74 73 68 69)
        (76 75 70 71)
        (77 76 71 72) //45
        (78 77 72 73)
        (79 78 73 74)
        (81 80 75 76)
        (82 81 76 77)
        (83 82 77 78) //50
        (84 83 78 79)
        (86 85 80 81)
        (87 86 81 82)
        (88 87 82 83)
        (89 88 83 84) //55

        (93 92 75 80)
        (48 47 96 97)
        (59 54 100 101)
    )

);

mergePatchPairs
(
);

// ************************************************************************* //
